app/Services/CartService.php

insert into `media` (`name`, `filename`, `path`, `mime_type`, `size`, `model_id`, `model_type`, `updated_at`, `created_at`) values (0, 'Dg0b3eeFbJYLTKnnS3d0oAnrHNyqsvpRcD23ynuL.png', 'cartItems/105/Dg0b3eeFbJYLTKnnS3d0oAnrHNyqsvpRcD23ynuL.png', 'image/png', 6813629, 105, 'App\Models\CartItem', '2022-01-07 12:02:53', '2022-01-07 12:02:53')
---
    public function addItemToCart(array $item, Collection|array $filesToUpload): bool
    {
        try {
            DB::beginTransaction();

            $cartItem  = $this->cart->items()->create($item);

            foreach ($filesToUpload as $key => $file) {
                $path = $file->store($cartItem->mediaRootFolderPath(), "public");

                $cartItem->media()->create([
                    "name" => $key,
                    "filename" => $file->hashName(),
                    "path" => $path,
                    "mime_type" => $file->getMimeType(),
                    "size" => $file->getSize()
                ]);