app/Services/CartService.php

    public static function removeItemFromCart(string|int $cartItemId): void
    {
        CartItem::where("cart_id", static::getAuthUserCart()->id)->where("id", $cartItemId)->first()->delete();
---
delete from `cart_items` where `cart_id` = 13 and `id` = 110