app/Services/CartService.php

insert into `carts` (`subtotal`, `user_id`, `updated_at`, `created_at`) values (0, 1, '2022-01-07 12:02:52', '2022-01-07 12:02:52')
insert into `cart_items` (`quantity`, `subtotal`, `selected_options`, `design_by_company`, `design_information`, `product_id`, `cart_id`, `updated_at`, `created_at`) values ('10', 29, '[]', 0, '', 30, 13, '2022-01-07 12:03:22', '2022-01-07 12:03:22')
---
    public static function addItemToCart(array $itemData, Collection|array $filesToUpload): bool
    {
        try {
            DB::beginTransaction();

            $cartItem  = static::getAuthUserCart()->items()->create($itemData);

select * from `cart_items` where `cart_items`.`cart_id` = 14 and `cart_items`.`cart_id` is not null and `cart_items`.`id` = 114 limit 1
update `cart_items` set `design_by_company` = 1, `cart_items`.`updated_at` = '2022-01-07 15:35:49' where `id` = 114
delete from `media` where `id` = 112
---
    public static function updateCartItem(
        int|string $cartItemId,
        array $newItemData,
        Collection|array $filesToUpload,
        array $oldMediaIdsToDelete
    ): bool {
        try {
            DB::beginTransaction();

            $cartItem  = static::getAuthUserCart()->items()->find($cartItemId);
            $cartItem->update($newItemData);

            foreach ($filesToUpload as $key => $file) {
                if ($file) {
                    $cartItem->addMediaItem($file, $key);
                }
            }

            Media::destroy($oldMediaIdsToDelete);

delete from `cart_items` where `cart_items`.`cart_id` = 13 and `cart_items`.`cart_id` is not null
---
    public static function removeItemFromCart(string|int $cartItemId): void
    {
        CartItem::where("cart_id", static::getAuthUserCart()->id)->where("id", $cartItemId)->delete();

select * from `coupons` where `code` = 'ererer' limit 1
---
    public static function applyCoupon(string|null $couponCode): array
    {
        $coupon = Coupon::where("code", $couponCode)->first();