app/Observers/CartItemObserver.php

    private function mutateCartSubtotal(CartItem $cartItem, string $mutationType): void
    {
        $cart = Cart::find($cartItem->cart_id);

        $newSubtotal = $mutationType === static::$INCREASE_SUBTOTAL
            ?  $cart->subtotal + $cartItem->subtotal
            : $cart->subtotal  - $cartItem->subtotal;

        $cart->update([
            "subtotal" => $newSubtotal
        ]);
---
select * from `carts` where `carts`.`id` = 12 limit 1
update `carts` set `subtotal` = 701, `carts`.`updated_at` = '2022-01-06 20:41:11' where `id` = 12