app/Http/Livewire/Cart/Dropdown.php

select * from `cart_items` where `cart_items`.`cart_id` in (14)
select * from `carts` where `user_id` is null limit 1
select * from `products` where `products`.`id` in (22, 30)
---
    public function render()
    {
        return view('livewire.cart.dropdown', [
            "cart" => Cart::where("user_id", auth()->id())->with(["items", "items.product"])->first()
        ]);