app/Http/Livewire/Cart/Index.php

    public function render()
    {
        return view('livewire.cart.index', [
            "cart" => Cart::where("user_id", auth()->id())->with(["items", "items.product"])->first()
        ]);
---
select * from `cart_items` where `cart_items`.`cart_id` in (13)
select * from `carts` where `user_id` = 1 limit 1
select * from `products` where `products`.`id` in (22, 30)