app/View/Components/Layout/Footer.php

    public function render()
    {
        return view('components.layout.footer', [
            "popularCategories" => Category::inRandomOrder()->take(12)->get()
        ]);
---
select * from `categories` order by RAND() limit 12