app/View/Components/Layout/NavbarBottom.php

    public function render()
    {
        return view('components.layout.navbar-bottom', [
            "categoryGroups" => CategoryGroup::orderBy("position")
                ->with(["categories", "categories.products" => fn($query) => $query->active()])
                ->get()
        ]);
---
select * from `categories` where `categories`.`group_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select * from `category_groups` order by `position` asc
select * from `products` where `products`.`category_id` in (1, 2, 3, 4, 5, 6)