app/Traits/HasMedia.php

delete from `media` where `model_id` = 100
---
    public static function bootHasMedia(): void
    {
        static::deleted(function ($model) {
            Storage::disk("public")->deleteDirectory($model->mediaRootFolderPath());

insert into `media` (`name`, `filename`, `path`, `mime_type`, `size`, `model_id`, `model_type`, `updated_at`, `created_at`) values ('recto', 'm5PlEojE0XOScDXMVEEHgqJvPlbrJPET0LqlbZam.jpg', 'cartItems/113/m5PlEojE0XOScDXMVEEHgqJvPlbrJPET0LqlbZam.jpg', 'image/jpeg', 101876, 113, 'App\Models\CartItem', '2022-01-07 14:11:16', '2022-01-07 14:11:16')
---
    public function addMediaItem(UploadedFile $file, string $mediaItemName): void
    {
        $path = $file->store($this->mediaRootFolderPath(), "public");

        $this->media()->create([
            "name" => $mediaItemName,
            "filename" => $file->hashName(),
            "path" => $path,
            "mime_type" => $file->getMimeType(),
            "size" => $file->getSize()
        ]);