app/Http/Controllers/ProductController.php

select * from `categories` where `categories`.`id` in (1)
---
    public function show(Product $product)
    {
        $product->load("category");