app/Models/Product.php

    public function scopeFilterProductsForShop($query, $search, $sort)
    {
        return $query->when($search, function ($query) use ($search) {
            return $query->where("title", "like", "%" . $search . "%");
        })
            ->when($sort && $sort !== "newest", function ($query) use ($sort) {
                if (in_array($sort, ["asc", "desc"])) {
                    return $query->orderBy("title", $sort);
                } elseif ($sort === "popular") {
                    return $query->wherePopular(1);
                }
            }, function ($query) {
                return $query->latest();
            })
            ->paginate(20)
            ->withQueryString();
---
select count(*) as aggregate from `products`