app/Http/Livewire/Products/PriceCalculator.php

    public function mount()
    {
        $cartItem = auth()->check() ? CartService::getAuthUserCart()->items()->find(request("cartItemId")) :  null;
---
select * from `carts` where `carts`.`user_id` = 1 and `carts`.`user_id` is not null limit 1
select * from `cart_items` where `cart_items`.`cart_id` = 13 and `cart_items`.`cart_id` is not null