app/View/Components/Products/Popular.php

select * from `products` where `popular` = 1
---
    public function render()
    {
        return view('components.products.popular', [
            "categories" => Category::wherePopular(1)->whereRelation("products", "active", true)->whereRelation("products", "popular", true)->with("products")->get()
        ]);